virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/pio.h
#define PIO_OWDR_P_Pos                        _U_(0)                                               /**< (PIO_OWDR Position) Output Write Disable */
#define PIO_OWDR_P_Msk                        (_U_(0xFFFFFFFF) << PIO_OWDR_P_Pos)                  /**< (PIO_OWDR Mask) P */
#define PIO_OWDR_P(value)                     (PIO_OWDR_P_Msk & ((value) << PIO_OWDR_P_Pos))       

/* -------- PIO_OWSR : (PIO Offset: 0xA8) ( R/ 32) Output Write Status Register -------- */
#define PIO_OWSR_P0_Pos                       _U_(0)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P0_Msk                       (_U_(0x1) << PIO_OWSR_P0_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P0(value)                    (PIO_OWSR_P0_Msk & ((value) << PIO_OWSR_P0_Pos))    
#define PIO_OWSR_P1_Pos                       _U_(1)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P1_Msk                       (_U_(0x1) << PIO_OWSR_P1_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P1(value)                    (PIO_OWSR_P1_Msk & ((value) << PIO_OWSR_P1_Pos))    
#define PIO_OWSR_P2_Pos                       _U_(2)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P2_Msk                       (_U_(0x1) << PIO_OWSR_P2_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P2(value)                    (PIO_OWSR_P2_Msk & ((value) << PIO_OWSR_P2_Pos))    
#define PIO_OWSR_P3_Pos                       _U_(3)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P3_Msk                       (_U_(0x1) << PIO_OWSR_P3_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P3(value)                    (PIO_OWSR_P3_Msk & ((value) << PIO_OWSR_P3_Pos))    
#define PIO_OWSR_P4_Pos                       _U_(4)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P4_Msk                       (_U_(0x1) << PIO_OWSR_P4_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P4(value)                    (PIO_OWSR_P4_Msk & ((value) << PIO_OWSR_P4_Pos))    
#define PIO_OWSR_P5_Pos                       _U_(5)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P5_Msk                       (_U_(0x1) << PIO_OWSR_P5_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P5(value)                    (PIO_OWSR_P5_Msk & ((value) << PIO_OWSR_P5_Pos))    
#define PIO_OWSR_P6_Pos                       _U_(6)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P6_Msk                       (_U_(0x1) << PIO_OWSR_P6_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P6(value)                    (PIO_OWSR_P6_Msk & ((value) << PIO_OWSR_P6_Pos))    
#define PIO_OWSR_P7_Pos                       _U_(7)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P7_Msk                       (_U_(0x1) << PIO_OWSR_P7_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P7(value)                    (PIO_OWSR_P7_Msk & ((value) << PIO_OWSR_P7_Pos))    
#define PIO_OWSR_P8_Pos                       _U_(8)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P8_Msk                       (_U_(0x1) << PIO_OWSR_P8_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P8(value)                    (PIO_OWSR_P8_Msk & ((value) << PIO_OWSR_P8_Pos))    
#define PIO_OWSR_P9_Pos                       _U_(9)                                               /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P9_Msk                       (_U_(0x1) << PIO_OWSR_P9_Pos)                        /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P9(value)                    (PIO_OWSR_P9_Msk & ((value) << PIO_OWSR_P9_Pos))    
#define PIO_OWSR_P10_Pos                      _U_(10)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P10_Msk                      (_U_(0x1) << PIO_OWSR_P10_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P10(value)                   (PIO_OWSR_P10_Msk & ((value) << PIO_OWSR_P10_Pos))  
#define PIO_OWSR_P11_Pos                      _U_(11)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P11_Msk                      (_U_(0x1) << PIO_OWSR_P11_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P11(value)                   (PIO_OWSR_P11_Msk & ((value) << PIO_OWSR_P11_Pos))  
#define PIO_OWSR_P12_Pos                      _U_(12)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P12_Msk                      (_U_(0x1) << PIO_OWSR_P12_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P12(value)                   (PIO_OWSR_P12_Msk & ((value) << PIO_OWSR_P12_Pos))  
#define PIO_OWSR_P13_Pos                      _U_(13)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P13_Msk                      (_U_(0x1) << PIO_OWSR_P13_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P13(value)                   (PIO_OWSR_P13_Msk & ((value) << PIO_OWSR_P13_Pos))  
#define PIO_OWSR_P14_Pos                      _U_(14)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P14_Msk                      (_U_(0x1) << PIO_OWSR_P14_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P14(value)                   (PIO_OWSR_P14_Msk & ((value) << PIO_OWSR_P14_Pos))  
#define PIO_OWSR_P15_Pos                      _U_(15)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P15_Msk                      (_U_(0x1) << PIO_OWSR_P15_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P15(value)                   (PIO_OWSR_P15_Msk & ((value) << PIO_OWSR_P15_Pos))  
#define PIO_OWSR_P16_Pos                      _U_(16)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P16_Msk                      (_U_(0x1) << PIO_OWSR_P16_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P16(value)                   (PIO_OWSR_P16_Msk & ((value) << PIO_OWSR_P16_Pos))  
#define PIO_OWSR_P17_Pos                      _U_(17)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P17_Msk                      (_U_(0x1) << PIO_OWSR_P17_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P17(value)                   (PIO_OWSR_P17_Msk & ((value) << PIO_OWSR_P17_Pos))  
#define PIO_OWSR_P18_Pos                      _U_(18)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P18_Msk                      (_U_(0x1) << PIO_OWSR_P18_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P18(value)                   (PIO_OWSR_P18_Msk & ((value) << PIO_OWSR_P18_Pos))  
#define PIO_OWSR_P19_Pos                      _U_(19)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P19_Msk                      (_U_(0x1) << PIO_OWSR_P19_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P19(value)                   (PIO_OWSR_P19_Msk & ((value) << PIO_OWSR_P19_Pos))  
#define PIO_OWSR_P20_Pos                      _U_(20)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P20_Msk                      (_U_(0x1) << PIO_OWSR_P20_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P20(value)                   (PIO_OWSR_P20_Msk & ((value) << PIO_OWSR_P20_Pos))  
#define PIO_OWSR_P21_Pos                      _U_(21)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P21_Msk                      (_U_(0x1) << PIO_OWSR_P21_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P21(value)                   (PIO_OWSR_P21_Msk & ((value) << PIO_OWSR_P21_Pos))  
#define PIO_OWSR_P22_Pos                      _U_(22)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P22_Msk                      (_U_(0x1) << PIO_OWSR_P22_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P22(value)                   (PIO_OWSR_P22_Msk & ((value) << PIO_OWSR_P22_Pos))  
#define PIO_OWSR_P23_Pos                      _U_(23)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P23_Msk                      (_U_(0x1) << PIO_OWSR_P23_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P23(value)                   (PIO_OWSR_P23_Msk & ((value) << PIO_OWSR_P23_Pos))  
#define PIO_OWSR_P24_Pos                      _U_(24)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P24_Msk                      (_U_(0x1) << PIO_OWSR_P24_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P24(value)                   (PIO_OWSR_P24_Msk & ((value) << PIO_OWSR_P24_Pos))  
#define PIO_OWSR_P25_Pos                      _U_(25)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P25_Msk                      (_U_(0x1) << PIO_OWSR_P25_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P25(value)                   (PIO_OWSR_P25_Msk & ((value) << PIO_OWSR_P25_Pos))  
#define PIO_OWSR_P26_Pos                      _U_(26)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P26_Msk                      (_U_(0x1) << PIO_OWSR_P26_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P26(value)                   (PIO_OWSR_P26_Msk & ((value) << PIO_OWSR_P26_Pos))  
#define PIO_OWSR_P27_Pos                      _U_(27)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P27_Msk                      (_U_(0x1) << PIO_OWSR_P27_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P27(value)                   (PIO_OWSR_P27_Msk & ((value) << PIO_OWSR_P27_Pos))  
#define PIO_OWSR_P28_Pos                      _U_(28)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P28_Msk                      (_U_(0x1) << PIO_OWSR_P28_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P28(value)                   (PIO_OWSR_P28_Msk & ((value) << PIO_OWSR_P28_Pos))  
#define PIO_OWSR_P29_Pos                      _U_(29)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P29_Msk                      (_U_(0x1) << PIO_OWSR_P29_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P29(value)                   (PIO_OWSR_P29_Msk & ((value) << PIO_OWSR_P29_Pos))  
#define PIO_OWSR_P30_Pos                      _U_(30)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P30_Msk                      (_U_(0x1) << PIO_OWSR_P30_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P30(value)                   (PIO_OWSR_P30_Msk & ((value) << PIO_OWSR_P30_Pos))  
#define PIO_OWSR_P31_Pos                      _U_(31)                                              /**< (PIO_OWSR) Output Write Status Position */
#define PIO_OWSR_P31_Msk                      (_U_(0x1) << PIO_OWSR_P31_Pos)                       /**< (PIO_OWSR) Output Write Status Mask */
#define PIO_OWSR_P31(value)                   (PIO_OWSR_P31_Msk & ((value) << PIO_OWSR_P31_Pos))  
#define PIO_OWSR_Msk                          _U_(0xFFFFFFFF)                                      /**< (PIO_OWSR) Register Mask  */

#define PIO_OWSR_P_Pos                        _U_(0)                                               /**< (PIO_OWSR Position) Output Write Status */
#define PIO_OWSR_P_Msk                        (_U_(0xFFFFFFFF) << PIO_OWSR_P_Pos)                  /**< (PIO_OWSR Mask) P */
#define PIO_OWSR_P(value)                     (PIO_OWSR_P_Msk & ((value) << PIO_OWSR_P_Pos))       

