virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/pio.h
/* -------- PIO_WPSR : (PIO Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define PIO_WPSR_WPVS_Pos                     _U_(0)                                               /**< (PIO_WPSR) Write Protection Violation Status Position */
#define PIO_WPSR_WPVS_Msk                     (_U_(0x1) << PIO_WPSR_WPVS_Pos)                      /**< (PIO_WPSR) Write Protection Violation Status Mask */
#define PIO_WPSR_WPVS(value)                  (PIO_WPSR_WPVS_Msk & ((value) << PIO_WPSR_WPVS_Pos))
#define PIO_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (PIO_WPSR) Write Protection Violation Source Position */
#define PIO_WPSR_WPVSRC_Msk                   (_U_(0xFFFF) << PIO_WPSR_WPVSRC_Pos)                 /**< (PIO_WPSR) Write Protection Violation Source Mask */
#define PIO_WPSR_WPVSRC(value)                (PIO_WPSR_WPVSRC_Msk & ((value) << PIO_WPSR_WPVSRC_Pos))
#define PIO_WPSR_Msk                          _U_(0x00FFFF01)                                      /**< (PIO_WPSR) Register Mask  */


/* -------- PIO_SCHMITT : (PIO Offset: 0x100) (R/W 32) Schmitt Trigger Register -------- */
#define PIO_SCHMITT_SCHMITT0_Pos              _U_(0)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT0_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT0_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT0(value)           (PIO_SCHMITT_SCHMITT0_Msk & ((value) << PIO_SCHMITT_SCHMITT0_Pos))
#define PIO_SCHMITT_SCHMITT1_Pos              _U_(1)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT1_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT1_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT1(value)           (PIO_SCHMITT_SCHMITT1_Msk & ((value) << PIO_SCHMITT_SCHMITT1_Pos))
#define PIO_SCHMITT_SCHMITT2_Pos              _U_(2)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT2_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT2_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT2(value)           (PIO_SCHMITT_SCHMITT2_Msk & ((value) << PIO_SCHMITT_SCHMITT2_Pos))
#define PIO_SCHMITT_SCHMITT3_Pos              _U_(3)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT3_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT3_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT3(value)           (PIO_SCHMITT_SCHMITT3_Msk & ((value) << PIO_SCHMITT_SCHMITT3_Pos))
#define PIO_SCHMITT_SCHMITT4_Pos              _U_(4)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT4_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT4_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT4(value)           (PIO_SCHMITT_SCHMITT4_Msk & ((value) << PIO_SCHMITT_SCHMITT4_Pos))
#define PIO_SCHMITT_SCHMITT5_Pos              _U_(5)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT5_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT5_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT5(value)           (PIO_SCHMITT_SCHMITT5_Msk & ((value) << PIO_SCHMITT_SCHMITT5_Pos))
#define PIO_SCHMITT_SCHMITT6_Pos              _U_(6)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT6_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT6_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT6(value)           (PIO_SCHMITT_SCHMITT6_Msk & ((value) << PIO_SCHMITT_SCHMITT6_Pos))
#define PIO_SCHMITT_SCHMITT7_Pos              _U_(7)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT7_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT7_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT7(value)           (PIO_SCHMITT_SCHMITT7_Msk & ((value) << PIO_SCHMITT_SCHMITT7_Pos))
#define PIO_SCHMITT_SCHMITT8_Pos              _U_(8)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT8_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT8_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT8(value)           (PIO_SCHMITT_SCHMITT8_Msk & ((value) << PIO_SCHMITT_SCHMITT8_Pos))
#define PIO_SCHMITT_SCHMITT9_Pos              _U_(9)                                               /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT9_Msk              (_U_(0x1) << PIO_SCHMITT_SCHMITT9_Pos)               /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT9(value)           (PIO_SCHMITT_SCHMITT9_Msk & ((value) << PIO_SCHMITT_SCHMITT9_Pos))
#define PIO_SCHMITT_SCHMITT10_Pos             _U_(10)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT10_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT10_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT10(value)          (PIO_SCHMITT_SCHMITT10_Msk & ((value) << PIO_SCHMITT_SCHMITT10_Pos))
#define PIO_SCHMITT_SCHMITT11_Pos             _U_(11)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT11_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT11_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT11(value)          (PIO_SCHMITT_SCHMITT11_Msk & ((value) << PIO_SCHMITT_SCHMITT11_Pos))
#define PIO_SCHMITT_SCHMITT12_Pos             _U_(12)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT12_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT12_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT12(value)          (PIO_SCHMITT_SCHMITT12_Msk & ((value) << PIO_SCHMITT_SCHMITT12_Pos))
#define PIO_SCHMITT_SCHMITT13_Pos             _U_(13)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT13_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT13_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT13(value)          (PIO_SCHMITT_SCHMITT13_Msk & ((value) << PIO_SCHMITT_SCHMITT13_Pos))
#define PIO_SCHMITT_SCHMITT14_Pos             _U_(14)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT14_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT14_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT14(value)          (PIO_SCHMITT_SCHMITT14_Msk & ((value) << PIO_SCHMITT_SCHMITT14_Pos))
#define PIO_SCHMITT_SCHMITT15_Pos             _U_(15)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT15_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT15_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT15(value)          (PIO_SCHMITT_SCHMITT15_Msk & ((value) << PIO_SCHMITT_SCHMITT15_Pos))
#define PIO_SCHMITT_SCHMITT16_Pos             _U_(16)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT16_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT16_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT16(value)          (PIO_SCHMITT_SCHMITT16_Msk & ((value) << PIO_SCHMITT_SCHMITT16_Pos))
#define PIO_SCHMITT_SCHMITT17_Pos             _U_(17)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT17_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT17_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT17(value)          (PIO_SCHMITT_SCHMITT17_Msk & ((value) << PIO_SCHMITT_SCHMITT17_Pos))
#define PIO_SCHMITT_SCHMITT18_Pos             _U_(18)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT18_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT18_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT18(value)          (PIO_SCHMITT_SCHMITT18_Msk & ((value) << PIO_SCHMITT_SCHMITT18_Pos))
#define PIO_SCHMITT_SCHMITT19_Pos             _U_(19)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT19_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT19_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT19(value)          (PIO_SCHMITT_SCHMITT19_Msk & ((value) << PIO_SCHMITT_SCHMITT19_Pos))
#define PIO_SCHMITT_SCHMITT20_Pos             _U_(20)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT20_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT20_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT20(value)          (PIO_SCHMITT_SCHMITT20_Msk & ((value) << PIO_SCHMITT_SCHMITT20_Pos))
#define PIO_SCHMITT_SCHMITT21_Pos             _U_(21)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT21_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT21_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT21(value)          (PIO_SCHMITT_SCHMITT21_Msk & ((value) << PIO_SCHMITT_SCHMITT21_Pos))
#define PIO_SCHMITT_SCHMITT22_Pos             _U_(22)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT22_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT22_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT22(value)          (PIO_SCHMITT_SCHMITT22_Msk & ((value) << PIO_SCHMITT_SCHMITT22_Pos))
#define PIO_SCHMITT_SCHMITT23_Pos             _U_(23)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT23_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT23_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT23(value)          (PIO_SCHMITT_SCHMITT23_Msk & ((value) << PIO_SCHMITT_SCHMITT23_Pos))
#define PIO_SCHMITT_SCHMITT24_Pos             _U_(24)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT24_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT24_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT24(value)          (PIO_SCHMITT_SCHMITT24_Msk & ((value) << PIO_SCHMITT_SCHMITT24_Pos))
#define PIO_SCHMITT_SCHMITT25_Pos             _U_(25)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT25_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT25_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT25(value)          (PIO_SCHMITT_SCHMITT25_Msk & ((value) << PIO_SCHMITT_SCHMITT25_Pos))
#define PIO_SCHMITT_SCHMITT26_Pos             _U_(26)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT26_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT26_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT26(value)          (PIO_SCHMITT_SCHMITT26_Msk & ((value) << PIO_SCHMITT_SCHMITT26_Pos))
#define PIO_SCHMITT_SCHMITT27_Pos             _U_(27)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT27_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT27_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT27(value)          (PIO_SCHMITT_SCHMITT27_Msk & ((value) << PIO_SCHMITT_SCHMITT27_Pos))
#define PIO_SCHMITT_SCHMITT28_Pos             _U_(28)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT28_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT28_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT28(value)          (PIO_SCHMITT_SCHMITT28_Msk & ((value) << PIO_SCHMITT_SCHMITT28_Pos))
#define PIO_SCHMITT_SCHMITT29_Pos             _U_(29)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT29_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT29_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT29(value)          (PIO_SCHMITT_SCHMITT29_Msk & ((value) << PIO_SCHMITT_SCHMITT29_Pos))
#define PIO_SCHMITT_SCHMITT30_Pos             _U_(30)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT30_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT30_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT30(value)          (PIO_SCHMITT_SCHMITT30_Msk & ((value) << PIO_SCHMITT_SCHMITT30_Pos))
#define PIO_SCHMITT_SCHMITT31_Pos             _U_(31)                                              /**< (PIO_SCHMITT) Schmitt Trigger Control Position */
#define PIO_SCHMITT_SCHMITT31_Msk             (_U_(0x1) << PIO_SCHMITT_SCHMITT31_Pos)              /**< (PIO_SCHMITT) Schmitt Trigger Control Mask */
#define PIO_SCHMITT_SCHMITT31(value)          (PIO_SCHMITT_SCHMITT31_Msk & ((value) << PIO_SCHMITT_SCHMITT31_Pos))
#define PIO_SCHMITT_Msk                       _U_(0xFFFFFFFF)                                      /**< (PIO_SCHMITT) Register Mask  */

#define PIO_SCHMITT_SCHMITT_Pos               _U_(0)                                               /**< (PIO_SCHMITT Position) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT_Msk               (_U_(0xFFFFFFFF) << PIO_SCHMITT_SCHMITT_Pos)         /**< (PIO_SCHMITT Mask) SCHMITT */
#define PIO_SCHMITT_SCHMITT(value)            (PIO_SCHMITT_SCHMITT_Msk & ((value) << PIO_SCHMITT_SCHMITT_Pos)) 

